Repository: CatalinFrancu/mule
Catalog: locale/*.utf8/LC_MESSAGES/messages.po
Languages: ro_ro

source: You have entered an invalid OpenID.
ro_ro: Ai introdus un OpenID incorect.

source: We cannot redirect you to the OpenID server
ro_ro: Nu te putem redirecta către serverul de OpenID

source: OpenID login canceled.
ro_ro: conectare cu OpenID anulată.

source: OpenID login failed
ro_ro: conectare cu OpenID eșuată.

source: The username must be between 3 and 20 characters long and consist of letters, digits, '-', '.' and '_'.
ro_ro: Numele de utilizator trebuie să aibă între 3 și 20 de caractere și să constea din litere, cifre, '-', '.' și '_'

source: This username is already in use.
ro_ro: Acest nume de utilizator este deja folosit.

source: The email address is invalid.
ro_ro: Adresa de e-mail este incorectă.

source: Home page
ro_ro: Pagina principală

source: Could not find your OpenID; did you really log in?
ro_ro: Nu ți-am putut găsi OpenID-ul; chiar te-ai conectat?

source: Changes saved.
ro_ro: Am salvat modificările.

source: my account
ro_ro: contul meu

source: New OpenID linked to your account.
ro_ro: Noul OpenID a fost legat de contul tău.

source: This OpenID is already linked to your account.
ro_ro: Acest OpenID este deja legat de contul tău.

source: This OpenID is already linked to another account. We cannot merge accounts. Please close the other account before linking the OpenID to this one.
ro_ro: Acest OpenID este deja legat de alt cont. Sistemul nu poate uni conturi. Te rugăm să închizi celălalt cont înainte de a lega OpenID-ul de acesta.

source: Please pick a username to complete your login.
ro_ro: Alege-ți un nume de utilizator pentru a completa conectarea.

source: OpenID login
ro_ro: conectare cu OpenID

source: Please enter an email address.
ro_ro: Te rugăm să introduci o adresă de e-mail.

source: There is no account with that email address.
ro_ro: Nu există niciun cont cu această adresă de e-mail.

source: We have sent you a one-time login code. Please check your email to complete the login process.
ro_ro: Ți-am trimis un cod de unică folosință. Te rugăm să-ți verifici e-mailul pentru a completa procesul de conectare.

source: Invalid token
ro_ro: Cod invalid

source: You have successfully logged in. Please remember to link an OpenID to your account.
ro_ro: Conectare reușită. Nu uita să legi un OpenID de contul tău.

source: Email login
ro_ro: Conectare prin e-mail

source: Email login token
ro_ro: Cod de conectare prin e-mail

source: home
ro_ro: acasă

source: logout
ro_ro: deconectare

source: Mule is working for you!
ro_ro: Mule funcționează!

source: Redirecting you to your OpenID provider...
ro_ro: Te redirectăm către furnizorul de OpenID...

source: login
ro_ro: conectare

source: If you have a Google or Yahoo account, you can use it as an OpenID:
ro_ro: Dacă ai un cont de Google say Yahoo, îl poți folosi ca OpenID:

source: Google account login
ro_ro: Conectare cu contul Google

source: Yahoo account login
ro_ro: Conectare cu contul Yahoo

source: If your OpenID provider is currently down, you can %srequest a one-time token%s via email.
ro_ro: Dacă furnizorul tău de OpenID este indisponibil momentan, poți %scere un cod de unică folosință%s prin e-mail.

source: What is OpenID?
ro_ro: Ce este OpenID?

source: OpenID logo
ro_ro: logo OpenID

source: is a faster, easier way to log in on the Internet.
ro_ro: este o modalitate mai rapidă și mai ușoară de a te autentifica pe Internet.

source: No need to create a new account on this site;
ro_ro: Nu este nevoie să îți creezi un cont nou pe acest site;

source: No need to remember yet another password;
ro_ro: Nu este nevoie să memorezi o parolă în plus;

source: Once created, an OpenID account can be reused on any website that accepts OpenIDs;
ro_ro: Un cont OpenID, odată creat, poate fi refolosit pe orice site care acceptă OpenID;

source: Chances are you already have an OpenID, because many popular sites (Google, Yahoo and others) act as OpenID providers.
ro_ro: Este posibil să ai deja un OpenID, deoarece multe site-uri populare (Google, Yahoo și altele) servesc ca furnizori de OpenID.

source: You can read more on the %sOpenID website%s.
ro_ro: Poți citi mai multe informații pe %ssite-ul OpenID%s (în limba engleză).

source: How do I obtain an OpenID?
ro_ro: Cum obțin un OpenID?

source: Check %sthe list of OpenID providers%s.
ro_ro: Consultă %slista de furnizori de OpenID%s.

source: You can use this form to request a one-time token to login via email. This may be necessary in two cases:
ro_ro: Cu acest formular poți cere un cod de unică folosință cu care să te conectezi prin e-mail. Poți avea nevoie de aceasta în două cazuri:

source: Your OpenID provider is currently down;
ro_ro: Furnizorul tău de OpenID este momentan indisponibil;

source: Your account was migrated from another system and is not linked with any OpenID yet.
ro_ro: Contul tău a fost migrat de pe alt sistem și încă nu este legat de niciun OpenID.

source: username
ro_ro: nume de utilizator

source: choose a username
ro_ro: alege-ți un nume de utilizator

source: required; 3-20 characters including letters, digits, '-', '.' and '_'
ro_ro: obligatoriu; 3-20 caractere incluzând litere, cifre, '-', '.' și '_'

source: name
ro_ro: nume

source: enter your full name
ro_ro: introdu numele tău complet

source: optional; 3-50 characters
ro_ro: opțional; 3-50 caractere

source: enter your email address
ro_ro: introdu adresa de e-mail

source: save
ro_ro: salvează

source: OpenID identities
ro_ro: Identități OpenID

source: link another OpenID to this account
ro_ro: leagă alt OpenID de acest cont

source: Hi,
ro_ro: Bună ziua,

source: You are receiving this message because you requested a one-time login token. To complete your login, please visit this link within one hour:
ro_ro: Primești acest mesaj deoarece ai cerut un cod de conectare de unică folosință. Pentru a completa conectarea, te rugăm să vizitezi această adresă în cel mult o oră:

source: If you did not request this token, please discard this message.
ro_ro: Dacă nu tu ai cerut codul, te rugăm să ignori acest mesaj.

source: Thank you,
ro_ro: Mulțumiri,
